public class homework {
    //    Доменное имя должно содержать от двух до 63 символов, начинаться и заканчиваться буквой латинского алфавита или цифрой.
//
//    Промежуточными символами могут быть буквы латинского алфавита, цифры или дефис.
//    Доменное имя не может содержать дефисы одновременно в 3-й и 4-й позициях.
//
//    Регистр букв в имени домена не имеет значения. EXAMPLE.COM и exAMple.Com
//    обозначают один и тот же домен. Для удобства, имена доменов всегда пишут в нижнем регистре.
//
//    Разрешены символы a-z, 0-9 и дефис. Дефис не может быть первым и последним символом.
//    Также запрещён случай, когда два дефиса стоят на 3 и 4 позиции (ab--cd)
//
//    Определите классы эквивалентности





}
